Tekla Open API Reference for Tekla Structures 2025
StringConstantFilterExpression Constructor (String)
 Initializes a new instance of the StringConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StringConstantFilterExpression(
	string Value
)
Public Sub New (
	Value As String
)
Parameters
Value
Type: System.String
The value to represent.
See Also
Reference
StringConstantFilterExpression Class
StringConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace